[
  {
    "name": "Phil Trotter",
    "title": "Lawyer",
    "bio": [
      "Phil Trotter is the senior lawyer and founder of Karuna Law Office. An immigration lawyer since 2010, he has successfully helped refugees settle in Canada, with greater security, human rights and freedom.",
      "Phil is a member in good standing with the Law Society of Ontario. He has represented refugees and migrants at the Immigration and Refugee Board (IRB), Refugee Protection Division (RPD), Refugee Appeal Division (RAD), Immigration Appeal Division (IAD), Federal Court and Federal Court of Appeal. Phil has also helped many refused refugees and other migrants obtain permanent residence through humanitarian and compassionate applications, and family class sponsorship permanent resident applications.",
      "Phil became a lawyer with the intention to be of service and benefit to people. Phil works with others to get positive results, with ethical efficiency, emphasizing truthfulness and kindness as the best way forward. After obtaining his law degree at McGill University in Montreal, Phil moved to Toronto, where he started his law practice in 2010. Since 2010, he has served and represented refugees from all over the world, helping them resettle with greater security and human rights in Canada. Phil has also been involved in politics, with the aim of contributing to a better world. Since 2019, he has been mostly representing Tibetan Buddhist refugees from India, Nepal, and Bhutan."
    ],
    "image": "phil_trotter.jpg",
    "location": "Toronto, CA",
    "socialLinks": {
      "linkedin": "https://ca.linkedin.com/in/philliptrotterlawyermediator",
      "email": "mailto:phil@karunalaw.ca"
    },

    "articles": [
      {
        "title": "Legal status of Tibetans migrants in Canadian refugee law",
        "date": "July 25, 2024",
        "url": "https://www.law360.ca/ca/articles/1861824/legal-status-of-tibetans-migrants-in-canadian-refugee-law",
        "description": "An overview of recent changes to Canadian immigration law and what they mean for applicants."
      }
    ]
  },
  {
    "name": "Rinchen Phuntsok | རིན་ཆེན་ཕུན་ཚོགས",
    "title": "Lawyer",
    "bio": [
      "Rinchen Phuntsok is a lawyer at Karuna Law Office. Recently called to the Ontario bar, he is the first Tibet-born Canadian lawyer, qualified to practice in both India and Canada. Having personally navigated the immigration process, he brings empathy and understanding to the clients he serves.",
      "Rinchen Phuntsok is a lawyer with a distinctive international legal background. Born in Tibet and trained in India, he earned his Master of Laws (LL.M.) before immigrating to Canada, where he qualified as a lawyer. He is the first Tibet-born Canadian lawyer qualified to practice in more than one jurisdiction — India and Canada — a milestone that reflects his dedication, resilience, and commitment to the legal profession.",
      "He helps clients navigate complex legal processes with clarity, confidence, and care. His personal experience going through immigration and refugee processes in Canada deeply informs his approach, allowing him to guide clients with greater genuine empathy and understanding.",
      "He speaks English, Tibetan, and Hindi, enabling him to communicate with clients from diverse cultural and linguistic backgrounds. He has also completed an Alternative Dispute Resolution (ADR) program in Canada, equipping him to resolve conflicts through mediation and other collaborative methods when appropriate. In India, he worked as a legal advisor for non-profit organizations.",
      "With multicultural roots, international qualifications, and lived experience, he is committed to making legal processes clear, supportive, and as stress-free as possible for every client."
    ],
    "image": "rinchen_phuntsok.jpg",
    "location": "Toronto, CA",
    "socialLinks": {
      "linkedin": "https://ca.linkedin.com/in/rinchen-phuntsok",
      "email": "mailto:rinchen@karunalaw.ca"
    },
    "articles": []
  },

  {
    "name": "Tenzin Yangphel | བསྟན་འཛིན་ཡང་འཕེལ",
    "title": "Legal Assistant",
    "bio": [
      "Tenzin Yangphel serves as a Legal Assistant and Law Clerk at Karuna Law Office, supporting counsel and assisting migrants and refugees.",
      "Born in Kharapather, Shimla, India, Tenzin completed his schooling at the Tibetan Children’s Village (TCV) schools—Lower TCV, TCV Selakui, and Upper TCV. During his time at Lower TCV, he served as School Captain. He earned his B.A. LL.B. from the University School of Law and Legal Studies, Guru Gobind Singh Indraprastha University (GGSIPU), New Delhi and completed internships with Mr. Rajiv Dutta, Senior Advocate at the Supreme Court of India, and Mr. Siddharth Dutta, Advocate at the Delhi High Court. He also worked as a Legal Researcher at the Tibetan Supreme Justice Commission in India.",
      "Alongside his legal education, Tenzin pursued studies in the Nalanda and Tibetan monastic traditions, having earned the Nalanda Diploma and currently pursuing the Nalanda Masters course offered by Tibet House, New Delhi. He also completed a six-month intensive course in Tibetan language and Buddhist philosophy at the School of Snowland Tibetan Studies.",
      "In August 2023, Tenzin immigrated to Canada and applied for refugee status, represented by Phil Trotter, lawyer and founder of Karuna Law. Under Phil’s guidance, Tenzin began assisting at the office in March 2024 and formally joined as a Legal Assistant in August 2025. In addition to his legal work, he completed the Personal Support Worker Certificate Program and works part-time as a Personal Support Worker at the Centre for Addiction and Mental Health (CAMH), caring for elderly and vulnerable patients.",
      "Tenzin intends to pursue accreditation through the National Committee on Accreditation (NCA), complete the bar licensing process, and ultimately practise law in Canada."
    ],
    "image": "tenzin.jpg",
    "location": "Toronto, CA",
    "socialLinks": {
      "linkedin": "https://www.linkedin.com/in/tenzin-yangphel",
      "email": "mailto:info@karunalaw.ca"
    },
    "articles": []
  }
]
